[
    {
        "id": 1,
        "category": "bacaan",
        "title": "Doa Iftitah (Allahumma Ba'id)",
        "title_en": "Iftitah Prayer (Allahumma Ba'id)",
        "arabic": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ",
        "latin": "Allahumma baa'id bainii wa baina khathaayaaya kamaa baa'adta bainal masyriqi wal maghrib. Allahumma naqqinii min khathaayaaya kamaa yunaqqats tsaubul abyadhu minad danas. Allahummaghsilnii min khathaayaaya bits tsalji wal maa-i wal barad.",
        "translation": "Ya Allah, jauhkanlah antara aku dan kesalahan-kesalahanku sebagaimana Engkau menjauhkan antara timur dan barat. Ya Allah, bersihkanlah aku dari kesalahan-kesalahanku sebagaimana baju putih dibersihkan dari kotoran. Ya Allah, cucilah aku dari kesalahan-kesalahanku dengan salju, air, dan embun.",
        "translation_en": "O Allah, distance me from my sins as You have distanced the East from the West. O Allah, purify me from my sins as a white garment is purified from dirt. O Allah, wash me from my sins with snow, water, and hail.",
        "audio": ""
    },
    {
        "id": 2,
        "category": "bacaan",
        "title": "Doa Iftitah (Allahu Akbar Kabiro)",
        "title_en": "Iftitah Prayer (Allahu Akbar Kabiro)",
        "arabic": "اللهُ أَكْبَرُ كَبِيرًا، وَالْحَمْدُ لِلَّهِ كَثِيرًا، وَسُبْحَانَ اللهِ بُكْرَةً وَأَصِيلًا",
        "latin": "Allahu akbar kabira, walhamdu lillahi katsira, wa subhanallahi bukratan wa ashila.",
        "translation": "Allah Maha Besar lagi Sempurna Kebesaran-Nya, segala puji bagi-Nya dan Maha Suci Allah sepanjang pagi dan petang.",
        "translation_en": "Allah is Most Great, much praise be to Allah, and glory be to Allah in the morning and evening.",
        "audio": ""
    },
    {
        "id": 3,
        "category": "bacaan",
        "title": "Doa Ruku",
        "title_en": "Ruku Prayer",
        "arabic": "سُبْحَانَ رَبِّيَ الْعَظِيمِ وَبِحَمْدِهِ",
        "latin": "Subhana rabbiyal 'adzimi wa bihamdih. (3x)",
        "translation": "Maha Suci Tuhanku Yang Maha Agung dan dengan segala puji bagi-Nya.",
        "translation_en": "Glory be to my Lord, the Almighty, and with His praise.",
        "audio": ""
    },
    {
        "id": 4,
        "category": "bacaan",
        "title": "Doa I'tidal",
        "title_en": "I'tidal Prayer",
        "arabic": "رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ",
        "latin": "Rabbana lakal hamdu mil'us samaawaati wa mil'ul ardhi wa mil'u maa syi'ta min syai'in ba'du.",
        "translation": "Ya Tuhan kami, bagi-Mu segala puji, sepenuh langit dan sepenuh bumi, dan sepenuh apa saja yang Engkau kehendaki sesudah itu.",
        "translation_en": "Our Lord, to You be all praise, filling the heavens and filling the earth and filling whatever else You will.",
        "audio": ""
    },
    {
        "id": 5,
        "category": "bacaan",
        "title": "Doa Sujud",
        "title_en": "Sujud Prayer",
        "arabic": "سُبْحَانَ رَبِّيَ الْأَعْلَى وَبِحَمْدِهِ",
        "latin": "Subhana rabbiyal a'la wa bihamdih. (3x)",
        "translation": "Maha Suci Tuhanku Yang Maha Tinggi dan dengan segala puji bagi-Nya.",
        "translation_en": "Glory be to my Lord, the Most High, and with His praise.",
        "audio": ""
    },
    {
        "id": 6,
        "category": "bacaan",
        "title": "Doa Duduk Diantara Dua Sujud",
        "title_en": "Sitting Between Two Sujood",
        "arabic": "رَبِّ اغْفِرْ لِي وَارْحَمْنِي وَاجْبُرْنِي وَارْفَعْنِي وَارْزُقْنِي وَاهْدِنِي وَعَافِنِي وَاعْفُ عَنِّي",
        "latin": "Rabbighfirli warhamni wajburni warfa'ni warzuqni wahdini wa 'afini wa'fu 'anni.",
        "translation": "Ya Tuhanku, ampunilah aku, rahmatilah aku, cukupkanlah segala kekuranganku, angkatlah derajatku, berilah rezeki kepadaku, berilah petunjuk kepadaku, berilah kesehatan kepadaku, dan maafkanlah aku.",
        "translation_en": "My Lord, forgive me, have mercy on me, mend me, raise my rank, provide for me, guide me, grant me health, and pardon me.",
        "audio": ""
    },
    {
        "id": 7,
        "category": "bacaan",
        "title": "Doa Tasyahud Awal",
        "title_en": "First Tashahhud",
        "arabic": "التَّحِيَّاتُ الْمُبَارَكَاتُ الصَّلَوَاتُ الطَّيِّبَاتُ لِلَّهِ، السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللهِ",
        "latin": "Attahiyyaatul mubaarakaatush shalawaatuth thayyibaatu lillah. Assalaamu 'alaika ayyuhan nabiyyu wa rahmatullahi wa barakaatuh. Assalaamu 'alainaa wa 'alaa 'ibaadillahis shaalihiin. Asyhadu an laa ilaaha illallah, wa asyhadu anna Muhammadar rasuulullah.",
        "translation": "Segala kehormatan, keberkahan, kebahagiaan, dan kebaikan adalah milik Allah. Semoga keselamatan, rahmat Allah, dan berkah-Nya tercurah kepadamu wahai Nabi. Semoga keselamatan tercurah kepada kami dan kepada hamba-hamba Allah yang saleh. Aku bersaksi bahwa tiada Tuhan selain Allah, dan aku bersaksi bahwa Muhammad adalah utusan Allah.",
        "translation_en": "All compliments, blessed prayers, and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah and His blessings. Peace be upon us and on the righteous slaves of Allah. I bear witness that there is no god but Allah, and I bear witness that Muhammad is the Messenger of Allah.",
        "audio": ""
    },
    {
        "id": 8,
        "category": "bacaan",
        "title": "Doa Qunut Subuh",
        "title_en": "Qunut Fajr Prayer",
        "arabic": "اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، فَإِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ، وَإِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ، وَلَا يَعِزُّ مَنْ عَادَيْتَ، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
        "latin": "Allahummahdini fiiman hadait, wa 'aafini fiiman 'aafait, wa tawallani fiiman tawallait, wa baarik li fiima a'thait, wa qini syarra maa qadhait, fainnaka taqdhi wa laa yuqdha 'alaik, wa innahu laa yadzillu man waalait, wa laa ya'izzu man 'aadait, tabaarakta rabbana wa ta'aalait.",
        "translation": "Ya Allah, berilah aku petunjuk sebagaimana orang-orang yang telah Engkau beri petunjuk. Berilah aku kesehatan sebagaimana orang-orang yang telah Engkau beri kesehatan. Peliharalah aku sebagaimana orang-orang yang telah Engkau pelihara. Berilah keberkahan kepadaku pada apa-apa yang telah Engkau karuniakan. Dan selamatkanlah aku dari bahaya kejahatan yang telah Engkau tentukan. Maka sesungguhnya Engkaulah yang menghukum dan bukan dihukum. Dan sesungguhnya tidak akan hina orang yang Engkau pimpin. Dan tidak akan mulia orang yang Engkau musuhi. Mahasuci Engkau wahai Tuhan kami dan Maha Tinggi Engkau.",
        "translation_en": "O Allah, guide me among those You have guided, grant me health among those You have granted health, take charge of me among those You have taken charge of, bless me in what You have given, and protect me from the evil of what You have decreed. For You decree and are not decreed against. Indeed, he whom You befriend is not humiliated, and he whom You oppose is not honored. Blessed are You, our Lord, and Exalted.",
        "audio": ""
    },
    {
        "id": 9,
        "category": "niat_wajib",
        "title": "Niat Sholat Subuh",
        "title_en": "Niyyah Fajr",
        "arabic": "اُصَلِّى فَرْضَ الصُّبْحِ رَكْعَتَيْنِ مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً ِللهِ تَعَالَى",
        "latin": "Ushallii fardhash-Shubhi rak’ataini mustaqbilal-qiblati adaa’an lillaahi ta’aalaa.",
        "translation": "Aku niat sholat fardhu Subuh dua rakaat menghadap kiblat karena Allah Ta'ala.",
        "translation_en": "I intend to perform the two Rak'ats of the Fajr prayer, facing the Qiblah, for the sake of Allah the Exalted.",
        "audio": ""
    },
    {
        "id": 10,
        "category": "niat_wajib",
        "title": "Niat Sholat Dzuhur",
        "title_en": "Niyyah Dhuhr",
        "arabic": "اُصَلِّى فَرْضَ الظُّهْرِ اَرْبَعَ رَكَعَاتٍ مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً ِللهِ تَعَالَى",
        "latin": "Ushallii fardhazh-Zhuhri arba’a raka’aatin mustaqbilal-qiblati adaa’an lillaahi ta’aalaa.",
        "translation": "Aku niat sholat fardhu Dzuhur empat rakaat menghadap kiblat karena Allah Ta'ala.",
        "translation_en": "I intend to perform the four Rak'ats of the Dhuhr prayer, facing the Qiblah, for the sake of Allah the Exalted.",
        "audio": ""
    },
    {
        "id": 11,
        "category": "niat_wajib",
        "title": "Niat Sholat Ashar",
        "title_en": "Niyyah Asr",
        "arabic": "اُصَلِّى فَرْضَ الْعَصْرِ اَرْبَعَ رَكَعَاتٍ مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً ِللهِ تَعَالَى",
        "latin": "Ushallii fardhal-'Ashri arba’a raka’aatin mustaqbilal-qiblati adaa’an lillaahi ta’aalaa.",
        "translation": "Aku niat sholat fardhu Ashar empat rakaat menghadap kiblat karena Allah Ta'ala.",
        "translation_en": "I intend to perform the four Rak'ats of the Asr prayer, facing the Qiblah, for the sake of Allah the Exalted.",
        "audio": ""
    },
    {
        "id": 12,
        "category": "niat_wajib",
        "title": "Niat Sholat Maghrib",
        "title_en": "Niyyah Maghrib",
        "arabic": "اُصَلِّى فَرْضَ الْمَغْرِبِ ثَلاَثَ رَكَعَاتٍ مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً ِللهِ تَعَالَى",
        "latin": "Ushallii fardhal-Maghribi tsalaatsa raka’aatin mustaqbilal-qiblati adaa’an lillaahi ta’aalaa.",
        "translation": "Aku niat sholat fardhu Maghrib tiga rakaat menghadap kiblat karena Allah Ta'ala.",
        "translation_en": "I intend to perform the three Rak'ats of the Maghrib prayer, facing the Qiblah, for the sake of Allah the Exalted.",
        "audio": ""
    },
    {
        "id": 13,
        "category": "niat_wajib",
        "title": "Niat Sholat Isya",
        "title_en": "Niyyah Isha",
        "arabic": "اُصَلِّى فَرْضَ الْعِشَاءِ اَرْبَعَ رَكَعَاتٍ مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً ِللهِ تَعَالَى",
        "latin": "Ushallii fardhal-'Isyaa-i arba’a raka’aatin mustaqbilal-qiblati adaa’an lillaahi ta’aalaa.",
        "translation": "Aku niat sholat fardhu Isya empat rakaat menghadap kiblat karena Allah Ta'ala.",
        "translation_en": "I intend to perform the four Rak'ats of the Isha prayer, facing the Qiblah, for the sake of Allah the Exalted.",
        "audio": ""
    },
    {
        "id": 18,
        "category": "niat_wajib",
        "title": "Niat Sholat Jumat",
        "title_en": "Niyyah Jumu'ah",
        "arabic": "اُصَلِّيْ فَرْضَ الْجُمْعَةِ رَكْعَتَيْنِ مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً مَاْمُوْمًا ِللهِ تَعَالَى",
        "latin": "Ushallii fardhal-Jum’ati rak’ataini mustaqbilal-qiblati adaa’an ma’muuman lillaahi ta’aalaa.",
        "translation": "Aku niat sholat fardhu Jumat dua rakaat menghadap kiblat menjadi makmum karena Allah Ta'ala.",
        "translation_en": "I intend to perform the two Rak'ats of the Jumu'ah prayer, facing the Qiblah, as a follower, for the sake of Allah the Exalted.",
        "audio": ""
    },
    {
        "id": 14,
        "category": "niat_sunnah",
        "title": "Niat Sholat Dhuha",
        "title_en": "Niyyah Dhuha",
        "arabic": "اُصَلِّى سُنَّةَ الضُّحٰى رَكْعَتَيْنِ مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً ِللهِ تَعَالَى",
        "latin": "Ushallii sunnatadh-Dhuhaa rak’ataini mustaqbilal-qiblati adaa’an lillaahi ta’aalaa.",
        "translation": "Aku niat sholat sunnah Dhuha dua rakaat menghadap kiblat karena Allah Ta'ala.",
        "translation_en": "I intend to perform the two Rak'ats of the Dhuha prayer, facing the Qiblah, for the sake of Allah the Exalted.",
        "audio": ""
    },
    {
        "id": 15,
        "category": "niat_sunnah",
        "title": "Niat Sholat Tahajud",
        "title_en": "Niyyah Tahajjud",
        "arabic": "اُصَلِّى سُنَّةً التَّهَجُّدِ رَكْعَتَيْنِ مُسْتَقْبِلَ الْقِبْلَةِ ِللهِ تَعَالَى",
        "latin": "Ushallii sunnatat-Tahajjudi rak’ataini mustaqbilal-qiblati lillaahi ta’aalaa.",
        "translation": "Aku niat sholat sunnah Tahajud dua rakaat menghadap kiblat karena Allah Ta'ala.",
        "translation_en": "I intend to perform the two Rak'ats of the Tahajjud prayer, facing the Qiblah, for the sake of Allah the Exalted.",
        "audio": ""
    },
    {
        "id": 16,
        "category": "niat_sunnah",
        "title": "Niat Sholat Witir",
        "title_en": "Niyyah Witr",
        "arabic": "اُصَلِّى سُنَّةَ الْوِتْرِ رَكْعَةً مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً ِللهِ تَعَالَى",
        "latin": "Ushallii sunnatal-Witri rak’atan mustaqbilal-qiblati adaa’an lillaahi ta’aalaa.",
        "translation": "Aku niat sholat sunnah Witir satu rakaat menghadap kiblat karena Allah Ta'ala.",
        "translation_en": "I intend to perform one Rak'at of the Witr prayer, facing the Qiblah, for the sake of Allah the Exalted.",
        "audio": ""
    },
    {
        "id": 17,
        "category": "niat_sunnah",
        "title": "Niat Sholat Tarawih",
        "title_en": "Niyyah Tarawih",
        "arabic": "اُصَلِّى سُنَّةَ التَّرَاوِيْحِ رَكْعَتَيْنِ مُسْتَقْبِلَ الْقِبْلَةِ اَدَاءً ِللهِ تَعَالَى",
        "latin": "Ushallii sunnatat-Taraawiihi rak’ataini mustaqbilal-qiblati adaa’an lillaahi ta’aalaa.",
        "translation": "Aku niat sholat sunnah Tarawih dua rakaat menghadap kiblat karena Allah Ta'ala.",
        "translation_en": "I intend to perform the two Rak'ats of the Tarawih prayer, facing the Qiblah, for the sake of Allah the Exalted.",
        "audio": ""
    },
    {
        "id": 19,
        "category": "sholat_jenazah",
        "title": "Niat Sholat Jenazah (Laki-laki)",
        "title_en": "Niyyah for Male Deceased",
        "arabic": "اُصَلِّى عَلَى هٰذَا الْمَيِّتِ اَرْبَعَ تَكْبِيْرَاتٍ فَرْضَ كِفَايَةٍ اِمَامًا/مَأْمُوْمًا ِللهِ تَعَالَى",
        "latin": "Ushallii 'alaa haadzal mayyiti arba'a takbiiraatin fardha kifaayatin imaaman/ma'muuman lillaahi ta'aalaa.",
        "translation": "Aku niat sholat atas jenazah ini empat kali takbir fardhu kifayah, sebagai imam/makmum karena Allah Ta'ala.",
        "translation_en": "I intend to offer the funeral prayer for this deceased male with four Takbirs, a fard kifaayah obligatoin, as an imam/follower, for Allah the Exalted.",
        "audio": ""
    },
    {
        "id": 20,
        "category": "sholat_jenazah",
        "title": "Niat Sholat Jenazah (Perempuan)",
        "title_en": "Niyyah for Female Deceased",
        "arabic": "اُصَلِّى عَلَى هٰذِهِ الْمَيِّتَةِ اَرْبَعَ تَكْبِيْرَاتٍ فَرْضَ كِفَايَةٍ اِمَامًا/مَأْمُوْمًا ِللهِ تَعَالَى",
        "latin": "Ushallii 'alaa haadzihil mayyitati arba'a takbiiraatin fardha kifaayatin imaaman/ma'muuman lillaahi ta'aalaa.",
        "translation": "Aku niat sholat atas jenazah ini empat kali takbir fardhu kifayah, sebagai imam/makmum karena Allah Ta'ala.",
        "translation_en": "I intend to offer the funeral prayer for this deceased female with four Takbirs, a fard kifaayah obligatoin, as an imam/follower, for Allah the Exalted.",
        "audio": ""
    },
    {
        "id": 21,
        "category": "sholat_jenazah",
        "title": "Takbir Pertama (Membaca Al-Fatihah)",
        "title_en": "1st Takbir (Al-Fatihah)",
        "arabic": "بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ. اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ. الرَّحْمٰنِ الرَّحِيْمِ. مٰلِكِ يَوْمِ الدِّيْنِ. اِيَّاكَ نَعْبُدُ وَاِيَّاكَ نَسْتَعِيْنُ. اِهْدِنَا الصِّرَاطَ الْمُسْتَقِيْمَ. صِرَاطَ الَّذِيْنَ اَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوْبِ عَلَيْهِمْ وَلَا الضَّاۤلِّيْنَ",
        "latin": "Bismillahirrahmanirrahim. Alhamdulillahi rabbil 'alamin...",
        "translation": "Membaca surat Al-Fatihah setelah takbir pertama.",
        "translation_en": "Recite Surah Al-Fatihah after the first Takbir.",
        "audio": ""
    },
    {
        "id": 22,
        "category": "sholat_jenazah",
        "title": "Takbir Kedua (Membaca Sholawat)",
        "title_en": "2nd Takbir (Salawat)",
        "arabic": "اَللّٰهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى اٰلِ مُحَمَّدٍ",
        "latin": "Allahumma shalli 'alaa Muhammad wa 'alaa aali Muhammad.",
        "translation": "Ya Allah, berilah shalawat kepada Nabi Muhammad dan keluarga Nabi Muhammad.",
        "translation_en": "O Allah, send prayers upon Muhammad and upon the family of Muhammad.",
        "audio": ""
    },
    {
        "id": 23,
        "category": "sholat_jenazah",
        "title": "Takbir Ketiga (Doa untuk Jenazah)",
        "title_en": "3rd Takbir (Prayer for Deceased)",
        "arabic": "اَللّٰهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ",
        "latin": "Allahummaghfir lahu warhamhu wa 'aafihi wa'fu 'anhu. (Ganti 'lahu' dengan 'laha' untuk perempuan)",
        "translation": "Ya Allah, ampunilah dia, berilah dia rahmat, selamatkanlah dia, dan maafkanlah dia.",
        "translation_en": "O Allah, forgive him, have mercy on him, give him health and pardon him. (Change 'him' to 'her' for female)",
        "audio": ""
    },
    {
        "id": 24,
        "category": "sholat_jenazah",
        "title": "Takbir Keempat (Doa Penutup)",
        "title_en": "4th Takbir (Closing Prayer)",
        "arabic": "اَللّٰهُمَّ لَا تَحْرِمْنَا أَجْرَهُ وَلَا تَفْتِنَّا بَعْدَهُ وَاغْفِرْ لَنَا وَلَهُ",
        "latin": "Allahumma laa tahrimnaa ajrahu wa laa taftinnaa ba'dahu waghfir lanaa wa lahu.",
        "translation": "Ya Allah, janganlah Engkau halangi kami dari pahalanya, dan janganlah Engkau fitnah kami sesudahnya, dan ampunilah kami dan dia.",
        "translation_en": "O Allah, do not deprive us of his reward, and do not subject us to trial after him, and forgive us and him.",
        "audio": ""
    },
    {
        "id": 25,
        "category": "sholat_jenazah",
        "title": "Salam",
        "title_en": "Taslim",
        "arabic": "اَلسَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ",
        "latin": "Assalaamu 'alaikum warahmatullaahi wa barakaatuh.",
        "translation": "Semoga keselamatan, rahmat Allah, dan berkah-Nya tercurah kepada kalian.",
        "translation_en": "Peace be upon you, and the mercy of Allah and His blessings.",
        "audio": ""
    }
]